Repository: ungureanudaniel/energyfit_karate
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ro

source: English
ro: Engleză

source: Deutsch
ro: Germană

source: Full name...
ro: Nume...

source: Phone number...
ro: Nr de telefon...

source: Subject...
ro: Subiect

source: Your message...
ro: Mesajul tău...

source: SUBSCRIBE NOW
ro: ABONAȚI-VĂ ACUM

source: And stay up to date with offers and news
ro: Și rămâneți la curent cu ofertele și noutățile

source: Email Address
ro: Adresa de e-mail

source: Subscribe
ro: ABONAȚI-VĂ

source: Add a service category
ro: Adăugați o categorie de servicii

source: Solve the
ro: Rezolvați

source: <h1 class="title">ENROLL <span>NOW</span></h1>
ro: <h1 class="title">ÎNSCRIE-TE <span>ACUM</span></h1>

source: Enroll
ro: Înscriete

source: Energyfit Karate Brașov offers the commitment to take you to your goals
ro: Energyfit Karate Brașov îți promite angajamentul de a te ghida către țelurile tale

source: Because we are fully committed to help you become a better you, in all areas
ro: Deoarece îți promitem angajamentul de a te ajuta să devii un tu mai bun, în toate domeniile

source: Training Experience
ro: Experiență în formare

source: Modern Karate Style
ro: Stil Modern de Karate

source: Belt colors in Fudokan
ro: Culoarea centurilor în Fudokan

source: The progress system is according to the two styles Shotokan and Fudokan. The grading is from 9 kyu (white belt) to 1 kyu (brown belt) and from 1 to 10 dan (black belt). A practitioner starts from the rank of 9 kyu - white belt, followed by the 3 red stripes on the white belt (8-6kyu) in order to reach the next belt color - yellow. According to the WFF periodization the examination is done according to well defined criteria following a period of training. During this examination, aspects related to technique, self-control, emotional balance, physical preparation plus other aspects are followed depending on the degree for which the examination is taken
ro: Sistemul de progres este conform celor două stiluri Shotokan și Fudokan. Gradația este de la 9 kyu (centura albă) pana la 1 kyu (centura maro) și de la 1 la 10 dan (neagră). Un practicant începe de la gradul de 9 kyu – centura albă și urmează cele 3 trese roșii pe centura albă (8-6kyu) până la următoarea culoare - galben. Conform periodizării WFF examinarea se face după criterii bine definite în urma unei perioade de pregătire. La această examinare sunt urmărite aspect legate de tehnică, autocontrol, echilibru emoțional, pregătire fizică plus alte aspect în funcție de gradul pentru care se susține examinarea

source: Prices for Every Pocket
ro: Prețuri pentru fiecare buzunar

source: Professional Trainers
ro: Antrenori profesioniști

source: Pictures of our day to day Fudokan martial arts training and events
ro: Imagini de la competiții și antrenamentele de zi cu zi în arte marțiale Fudokan

source: <h1 class='title'>OUR <span>NEWS</span></h1>
ro: <h1 class='title'>Știrile <span>Noastre</span></h1>

source: <h1 class='title'>OUR <span>EVENTS</span></h1>
ro: <h1 class='title'>EVENIMENTELE <span>NOASTRE</span></h1>

source: Pricing Plan
ro: Abonamente

source: <h1 class='title'>OUR <span>PRICING PLANS</span></h1>
ro: <h1 class='title'>ABONAMENTELE <span>NOASTRE</span></h1>

source: Fudokan belts
ro: Centuri Fudokan

source: Find your place in our team <span>Now
ro: Găsește-ți acum locul în echipa <span>Noastră

source: <h2 class='section-title'>To <span>Apply</span> Write Us <span>Today!</span></h2>
ro: <h2 class='section-title'>Pentru a <span>Aplica</span> Scrieți-ne <span>Astăzi!</span></h2>

source: And we will reach back to you as soon as possible
ro: Și vă vom contacta în cel mai scurt timp posibil

source: <h2 class='section-title'>OUR <span>OFFERING</span></h2>
ro: <h2 class='section-title'>CE <span>OFERIM</span></h2>

source: <h2 class='section-title'>FREQUENTLY ASKED <span>QUESTIONS</span></h2>
ro: <h2 class='section-title'>ÎNTREBĂRI <span>FRECVENTE</span></h2>

source: <h2 class='section-title'>WHY CHOOSE OUR <span>TRAINING</span></h2>
ro: <h2 class='section-title'>DE CE SĂ ALEGI <span>ANTRENAMENTELE NOASTRE</span></h2>

source: Register Now
ro: Înregistrați-vă acum

source: <h2 class='widget-title'>Key Benefits of OUR <span>Fudokan Training</span></h2>
ro: <h2 class='widget-title'>Principalele beneficii ale antrenamentelor noastre în<span>Fudokan</span></h2>

source: <h2 class='widget-title'>What you Learn from this <span>Training</span></h2>
ro: <h2 class='widget-title'>Ce veți învăța din aceste <span>Antrenamente</span></h2>

source: EXPERIENCED TRAINERS
ro: FORMATORI CU EXPERIENȚĂ

source: GET IN SHAPE
ro: PUNEȚI-VĂ ÎN FORMĂ

source: DEFEND YOURSELF
ro: APĂRAȚI-VĂ

source: GAIN CONFIDENCE
ro: CÂȘTIGAȚI ÎNCREDEREA ÎN SINE

source: SET GOALS
ro: STABILIȚI OBIECTIVE

source: BE PART OF A FAMILY
ro: FACEȚI PARTE DINTR-O FAMILIE

source: Our Senseis are the best you can find the area, warm, calm and armed with enough patience to guide through building a better you
ro: Senseii noștri sunt cei mai buni pe care îi puteți găsi în zonă, calzi, calmi și înarmați cu suficientă răbdare pentru a vă ghida în construirea unei sine mai bun

source: We will take children and adults on a building strength journey first
ro: Vom lua copiii și adulții, în primul rând, într-o călătorie de îmbunătățire a fitness-ului

source: They will learn defensive moves and the importance of using what they learn only in defence
ro: Vor învăța mișcări defensive și importanța de a folosi ceea ce învață doar în apărare

source: <h2 class='widget-title'>Who is this <span>Training</span> for</h2>
ro: <h2 class='widget-title'>Pentru cine sunt aceste <span>Antrenamente</span></h2>

source: If you cannot find an answer to your question in this section below, then please white us an email
ro: Dacă nu găsiți un răspuns la întrebarea dvs. în această secțiune de mai jos, vă rugăm să ne trimiteți un e-mail

source: <h1 class='title'>TRAINING <span>DETAILS</span></h1>
ro: <h1 class='title'>DETALII DESPRE <span>FORMARE</span></h1>

source: Training Details
ro: Detalii despre antrenamente

source: Enter Name
ro: Introduceți numele

source: Type in your name
ro: Introduceți numele dvs

source: Type in your email
ro: Introduceți e-mailul dvs

source: Phone Number
ro: Nr de telefon

source: Type in your phone number
ro: Introduceți numărul dvs de telefon

source: Read More
ro: Aflați mai multe

source: <h1 class='title'>ABOUT <span>US</span></h1>
ro: <h1 class='title'>DESPRE <span>NOI</span></h1>

source: Select your desired class
ro: Selectați clasa dorită

source: Write Message
ro: Scrieți mesajul

source: Start typing your message here
ro: Începeți să scrieți mesajul dvs. aici

source: Get Enrolled Now
ro: Înscrieți-vă acum

source: <h2 class='section-title'>We can provide you one of the <span>Best Fudokan Training Programs in Romania.</span></h2></span></h2>
ro: <h2 class='section-title'>Vă putem oferi unul dintre <span>Cele mai bune programe de formare Fudokan din România.</span></h2>

source: Learn to practice and master Fudokan martial arts together with a beautiful team that may become a second family! This Karate style is proven to enhance self defence abilities, focus on tasks, self awareness, improves balance in life and relieves stress, all while you build up fitness and health
ro: Învățați să practicați și să stăpâniți artele marțiale Fudokan împreună cu o echipă frumoasă care poate deveni o a doua familie! S-a dovedit că acest stil de karate îmbunătățește abilitățile de autoapărare, concentrarea asupra sarcinilor, conștientizarea sinelui, îmbunătățește echilibrul în viață și ameliorează stresul, toate acestea în timp ce vă construiți o formă fizică bună și sănătate

source: Monday
ro: Luni

source: Training calendar
ro: Calendarul antrenamentelor

source: Contact Program
ro: Program de Contact

source: Wednesday
ro: Miercuri

source: Saturday
ro: Sâmbătă

source: One of the best karate schools in Brașov
ro: Una dintre cele mai bune școli de karate din Brașov

source: Home
ro: Acasă

source: About us
ro: Despre noi

source: Training
ro: Formare

source: Explore
ro: Explorați

source: Gallery
ro: Galerie

source: Events
ro: Evenimente

source: Pricing plan
ro: Plan de prețuri

source: Trainers
ro: Antrenori

source: News
ro: Știri

source: Language
ro: Limbă

source: Contact us
ro: Contact

source: FUDOKAN SCHOOL IN BRASOV
ro: ȘCOALĂ DE FUDOKAN DIN BRAȘOV

source: #1 FUDOKAN MARTIAL ARTS SCHOOL IN BRASOV
ro: ȘCOALA #1 DE ARTE MARȚIALE FUDOKAN ÎN BRAȘOV

source: <h1 class='title'>CONTACT <span>US</span></h1>
ro: <h1 class='title'>CONTACTAȚI-NE <span></span></h1>

source: view on map
ro: vezi pe hartă

source: SEND MAIL
ro: SCRIE UN EMAIL

source: send now
ro: trimite

source: <h2 class='section-title'>A burning Question? Feel Free to get directly in <span>Contact</span> with Us!</h2>
ro: <h2 class='section-title'>O întrebare arzătoare? Nu ezita să iei rapid <span>Legătura</span> cu noi!</h2>

source: Using this form
ro: Folosind acest formular

source: FREE ADVICE
ro: CONSILIERE GRATUITĂ

source: We will offer any info you need before deciding to join us
ro: Îți vom oferi orice informație de care ai nevoie înainte de a decide să te alături

source: MODERN TEACHING
ro: PREDARE MODERNĂ

source: Innovative and child friendly training programs
ro: Programe de formare inovatoare și prietenoase cu copiii

source: BEST TRAINERS
ro: CEI MAI BUNI ANTRENORI

source: Our teachers have high achievements and most important, patience and kindness
ro: Senseii noștri au realizări înalte și, cel mai important, răbdare și bunătate

source: FLEXIBLE FEES
ro: TARIFE FLEXIBILE

source: Our training fees plans are flexible to help anyone experience Fudokan
ro: Planurile noastre de tarifare sunt flexibile pentru a ajuta pe oricine să experimenteze Fudokan

source: FOLLOW US
ro: URMĂREȘTE-NE

source: A burning Question? Feel Free to get directly in <span>Contact</span> with Us!
ro: Ai o întrebare arzătoare? Poți intra în <span>Contact</span>direct cu Noi!

source: <h2 class='section-title'>Get More <span>Information</span></h2>
ro: <h2 class='section-title'>Obțineți mai multe <span>Informații</span></h2>

source: Join over
ro: Alătură-te celor peste

source: Send
ro: Trimite

source: White
ro: Albă

source: White + 1 red stripe
ro: Albă + 1 bandă roșie

source: White + 2 red stripes
ro: Albă + 2 benzi roșii

source: White + 3 red stripes
ro: Albă + 3 benzi roșii

source: Yellow
ro: Galbenă

source: Orange
ro: Portocalie

source: Green
ro: Verde

source: Blue
ro: Albastră

source: Brown
ro: Maro

source: Black
ro: Neagră

source: Rank is used in karate to indicate experience, expertise, and to a lesser degree, seniority. As with many martial arts, Fudokan uses a system of coloured belts to indicate rank. The order of colours varies widely from school to school, but usually belts are denoted with colours that in some schools become darker as a student approaches shodan. Dan level belts are invariably black, with some schools using stripes to denote various ranks of black belt
ro: Rangul este folosit în karate pentru a indica experiența, expertiza și, într-o măsură mai mică, vechimea. La fel ca în cazul multor arte marțiale, Fudokan folosește un sistem de centuri colorate pentru a indica rangul. Ordinea culorilor variază foarte mult de la o școală la alta, dar, de obicei, centurile sunt indicate cu culori care, în unele școli, devin mai închise pe măsură ce un elev se apropie de shodan. Curelele de nivel Dan sunt invariabil negre, iar unele școli folosesc dungi pentru a indica diferitele grade de centură neagră

source: Energyfit Karate Brașov is the only Fudokan martial arts school in Brașov, a karate style that teaches modesty, focus and fighting for true human values. Our school has one of the most innovative and child friendly training programs you can find
ro: Energyfit Karate Brașov este singura școală de arte marțiale Fudokan din Brașov, un stil de karate care învață modestia, concentrarea și lupta pentru adevăratele valori umane. Școala noastră are unul dintre cele mai inovatoare și prietenoase programe de antrenament pentru copii pe care le puteți găsi

source: Telephone
ro: Telefon

source: Designed By
ro: Dezvoltat de

source: Opening Hours
ro: Program de lucru

source: OFFICE ADDRESS
ro: ADRESĂ DE CORESPONDENȚĂ

source: TELEPHONE NUMBER
ro: NUMĂR DE TELEFON

source: call now
ro: sună acum

source: By contacting us using one of the options below
ro: Contactându-ne folosind una dintre opțiunile de mai jos

source: #1 FUDOKAN MARTIAL ARTS SCHOOL IN BRAȘOV
ro: ȘCOALA #1 DE ARTE MARȚIALE FUDOKAN în BRAȘOV

source: BALANCE YOUR LIFE
ro: ECHILIBREAZĂ-ȚI VIAȚA

source: IMPROVE MIND, BODY & SPIRIT
ro: ÎMBUNĂTĂȚEȘTE MINTEA, CORPUL ȘI SPIRITUL

source: STAY FIT
ro: RĂMÂI ÎN FORMĂ

source: GAIN SPEED, FOCUS AND STRENGTH
ro: CREȘTE VITEZA, CONCENTRAREA ȘI FORȚA

source: FUDOKAN SCHOOL IN BRAȘOV
ro: ȘCOALA DE FUDOKAN în BRAȘOV

source: Enroll Now
ro: Înscrieți-vă acum

source: Training Classes
ro: Antrenamente

source: OUR OFFERING
ro: OFERTA NOASTRĂ

source: What we offer
ro: Ce oferim

source: ABOUT <span>ENERGYFIT KARATE</span> BRASOV
ro: DESPRE <span>ENERGYFIT KARATE</span> BRAȘOV

source: Energyfit Karate Brasov is the only Fudokan martial arts school in Brasov, a karate style that teaches modesty, focus and fighting for true human values. Our school has one of the most innovative and child friendly training programs you can find
ro: Energyfit Karate Brasov este singura școală de arte marțiale Fudokan din Brașov, un stil karate care presupune modestie, concentrare și lupta pentru adevăratele valori umane. Școala noastră are una dintre cele mai inovative programe de antrenament

source: FITNESS TRAINING
ro: ANTRENAMENT PENTRU FITNESS

source: Each Fudokan training session includes cardio, strength & stretching exercises, for a healthy body and a sharp mind
ro: Fiecare antrenament Fudokan include cardio, forță și de întindere, pentru un corp sănătos și o minte ascuțită

source: The process of physical training and learning precise moves will also train one to focus mental energy
ro: Procesul de pregătire fizică și de învățare a unor mișcări precise va stimula concentrarea energiei mentale

source: SELF CONFIDENCE
ro: ÎNCREDERE ÎN SINE

source: Advancing through the various training stages, improves self-confidence and mastering self-defence
ro: Avansarea prin etapele antrenamentelor, îmbunătățește încrederea în sine și abilitățile de auto-apărare

source: If one stay long enough with us, he will start setting their own goals, participate into competitions and gain achievements, which in turn will model them him to be persons that sets goals in life and can put the necessary work and skills to reach them
ro: Dacă studenții rămân suficient de mult timp cu noi, vor începe să își stabilească propriile obiective, să participe la competiții și să obțină rezultate, ceea ce îi va modela să în persoane care își stabilesc obiective în viață și care pot depune munca și abilitățile necesare pentru a le atinge

source: <h2 class='section-title'><span>FUDOKAN KARATE</span> CHARACTERISTICS</h2>
ro: <h2 class='section-title'> CARACTERISTICILE <span>FUDOKAN</span></h2>

source: FIT FOR ANY AGE
ro: POTRIVIT PENTRU ORICE VÂRSTĂ

source: It is never too late to start learning Fudokan
ro: Nu este niciodată prea târziu să înveți Fudokan

source: IMPROVES YOUR FITNESS
ro: ÎMBUNĂTĂȚEȘTE CONDIȚIA FIZICĂ

source: Fudokan develops endurance, strength and mobility
ro: Fudokan dezvoltă rezistența, forța și mobilitatea

source: TEACHES SELF-DEFENCE
ro: ÎNVAȚĂ AUTOAPĂRARE

source: Martial artists deal with bullying in a less violent way
ro: Practicanții de Fudokan abordează bullying-ul fără violență

source: DEVELOPS CHARACTER
ro: DEZVOLTĂ CARACTERUL

source: Fudokan karate means harmony with society
ro: Fudokan înseamnă armonie cu societatea

source: ENCOURAGES SELF-DISCIPLINE
ro: ÎNCURAJEAZĂ AUTODISCIPLINA

source: Fudokan is more than a sport, it is a lifestyle
ro: Fudokan mai degrabă un stil de viață

source: HONES LEADERSHIP SKILLS
ro: PERFECȚIONEAZĂ ABILITĂȚILE DE LIDER

source: Fudokan teaches leadership traits through respect
ro: Fudokan învață trăsăturile de leader prin respect

source: JOIN OUR CLASSES
ro: ÎNSCRIE-TE LA CURSURILE NOASTRE

source: BECOME A BETTER YOU
ro: DEVINO UN TU MAI BUN

source: You will become stronger, faster, more focused, more motivated to reach your goals and we are committed to take you there
ro: Vei deveni mai puternic, mai rapid, mai concentrat, mai motivat să îți atingegi obiectivele, iar noi ne angajăm să te ducem acolo

source: Join Now
ro: Alăturăte acum

source: MORE ABOUT WHAT<span> YOU</span> WILL LEARN HERE
ro: MAI MULTE DESPRE CE <span> VEI</span> ÎNVĂȚA AICI

source: COMING SOON
ro: ÎN CURÂND

source: Go Back Home
ro: Înapoi acasă

source: Beginners, +10 years old
ro: Începători, +10 ani

source: Intermediate, +10 years old
ro: Intermediari, +10 ani

source: +16 years old
ro: +16 ani

source: Beginners, +6 years old
ro: Începători, +6 ani

source: Advanced
ro: Avansați

source: We are sorry, but the page you are looking for is temporarily unavailable. Please come back later
ro: Ne cerem scuze, dar pagina pe care o cauți este temporar indisponibilă. Încearcă din nou mai târziu

source: OUR <span>SENSEIS</span>
ro: SENSEII <span>NOȘTRI</span>

source: More
ro: Mehr

source: Sensei Catalin Petre is the creator of this school and he teaches with the help of Sensei Karol
ro: Sensei Cătălin Petre este creatorul acestei școli și predă cu ajutorul lui Sensei Karol

source: OUR <span>FUDOKAN</span> EVENTS
ro: EVENIMENTELE NOASTRE <span>FUDOKAN</span>

source: OUR <span></span> TESTIMONIALS
ro: TESTIMONIALELE <span>NOASTRE</span>

source: OUR <span>MEMBERSHIP</span> PLAN
ro: PLANUL NOSTRU DE</span> ABONAMENTE

source: We are trying to fit every situation and every pocket
ro: Încercăm să ne adaptăm la fiecare situație și la fiecare buzunar

source: Monthly
ro: Lunar

source: students
ro: studenți

source: Trimestral
ro: Trimestrial

source: Per Session
ro: Per Sesiune

source: month
ro: lună

source: session
ro: sesiune

source: Monday and Wednesday every week
ro: Luni și Miercuri în fiecare săptămână

source: Membership
ro: Abonamente

source: Beginner
ro: Începători

source: EnergyFit Karate Brasov Sports Club was founded in 2017 by Petre Cătălin sensei (3 dan - fudokan). From 2014 until now the club has gone through several stages that have shaped this sports structure. EnergyFit started from the passion for martial arts of sensei Petre Cătălin who started this path since 2004 at C.S. Petrom Ploiești. Trained by the two sensei Apostol Liviu and Ileana, Cătălin developed a passion for this martial arts path since primary school, and in 2009 he consolidated this path through the Faculty of Physical Education and Sport at Transilvania University of Brașov. His curiosity for the academic and pedagogical environment continued in 2014 by pursuing master studies in the same university on a detailed specialization, Psychomotor Diagnosis and Prognosis - Research in Performance Sport. Cătălin's passion for karate was also noticed by the professors of Transylvania University who decided to give him the opportunity to teach the Combat and Self-Defense courses in the Faculty of Physical Education and Mountain Sports. Also in 2014, the sports club EnergyFit Karate Brașov was founded out of the desire to apply what was learnt at Transylvania University. Sensei Petre Cătălin strengthened the passion for karate with scientific training, the group of athletes allowed research through various scientific studies that later blossomed into competitive results and professionalism of students who go through the program applied in the club EnergyFit Karate Brașov. Currently the club is organizationally made up of the President, Vice President and Secretary and consists of:
ro: Clubul Sportiv EnergyFit Karate Braşov a fost înfiinţat în anul 2017 de sensei Petre Cătălin (3 dan - fudokan). Din 2014 până în prezent clubul a trecut prin mai multe etape care au conturat această structură sportivă. EnergyFit a început din pasiunea pentru arte marţiale a senseiului Petre Cătălin care a început această cale încă din anul 2004 la C.S. Petrom Ploieşti. Antrenat de cei doi sensei Apostol Liviu şi Ileana, Cătălin a dezvoltat o pasiune pentru această cale a artelor marţiale încă din băncile şcolii primare, urmând ca în anul 2009 să consolideze această cale prin intermediul Facultăţii de Educaţie Fizică şi Sport în cadrul Universităţii Transilvania din Braşov. Curiozitatea pentru mediul academic şi pedagogic a continuat în 2014 prin urmărea studiilor de master în aceeaşi universitate pe o specializare detaliată, Diagnoză şi Prognoză Psihomotrica - Cercetare în Sportul de Performanţă. Pasiunea pentru karate a lui Cătălin a fost observată şi de profesorii din Universitatea Transilvania care au decis să îi dea ocazia acestuia să predea cursurile de Combat şi Autoapărare din cadrul Facultăţii de Educaţie Fizică şi Sporturi Montane. Tot în anul 2014 se înfiinţează clubul sportiv EnergyFit Karate Braşov din dorinţa de a aplica cele învăţate în băncile Universităţii Transilvania. Sensei Petre Cătălin a consolidat pasiunea pentru karate cu antrenamentul ştiinţific, grupa de sportivi a permis cercetarea prin diferite studii ştiinţifice care mai târziu au înflorit prin rezultate competiţionale şi profesionalismul elevilor care trec prin programul aplicat în clubul EnergyFit Karate Braşov. În prezent clubul este alcătuit la nivel organizaţional de preşedinte, vicepreşedinte şi secretar şi este format din:

source: Over 50 athletes
ro: Peste 50 de sportivi

source: Four groups
ro: Doi sensei - Petre Cătălin - 3 dan, Czoguly Karoly - 1 dan

source: Two sensei - Petre Cătălin - 3 dan, Czoguly Karoly - 1 dan
ro: Doi sensei - Petre Cătălin - 3 dan, Czoguly Karoly - 1 dan

source: Four Fudokan licensed referees
ro: Patru arbitrii licenţiaţi Fudokan

source: An official partner - Patronage of Family Doctors Brasov
ro: Un partener oficial - Patronatul Medicilor de familie Braşov

source: Two media partners - Info1Tv, Radio Romania Brasov FM
ro: Doi parteneri media - Info1Tv, Radio România Braşov FM

source: A partnership with Johannes Honterus National College
ro: Un parteneriat cu Colegiul Naţional Johannes Honterus

source: We enjoy the support of over 1600 followers who we make proud every year with our intense competitive activity. From 6 medals in 2016 we manage to boast over 200 medals in 2023 of which half are international
ro: Ne bucurăm de susţinerea a peste 1600 de urmăritori pe care îi facem mândrii în fiecare an cu activitatea competiţională intensă. De la 6 medalii în anul 2016 reuşim să ne mândrim în anul 2023 cu peste 200 de medalii din care jumătate sunt internaţionale

source: For those need professional counseling into Fudokan we are always here to help
ro: Pentru cei care au nevoie de consiliere profesională în Fudokan suntem întotdeauna aici pentru a vă ajuta

source: Initiation into Kobudo
ro: Iniţiere în Kobudo

source: Initiation into Fudokan karate
ro: Iniţiere în karate Fudokan

source: We initiate anyone into Fudokan starting at the age of 6. Each student learns by his own rythm
ro: Noi inițiem pe oricine în Fudokan începând cu vârsta de 6 ani. Fiecare elev învață după propriul ritm

source: General physical training
ro: Pregătire fizică generală

source: Hours on the Tatami
ro: Ore pe Tatami

source: Medals
ro: Medalii

source: If your wish is just to get fit, Fudokan also comprises that and we will help you to get strength, elasticity and endurance
ro: Dacă dorința dvs. este doar să vă puneți în formă, Fudokan cuprinde și asta și vă vom ajuta să obțineți forță, elasticitate și rezistență
