Repository: ungureanudaniel/energyfit_karate
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ro

source: Kobudo is a traditional specific weapon fighting style, useful for self-defence in different situations
ro: Kobudo este un stil tradițional de luptă cu arme, util pentru autoapărare în diferite situații

source: OUR <span>FUDOKAN</span> TUTORIALS
ro: TUTORIALE <span>FUDOKAN</span>

source: <h1 class='title'>OUR PRESENCE IN THE <span>MEDIA</span></h1>
ro: <h1 class='title'>PREZENȚA NOASTRĂ ÎN <span>MEDIA</span></h1>

source: LATEST <span>NEWS</span> FROM ENERGYFIT KARATE BRAȘOV
ro: ULTIMELE <span>ȘTIRI</span> de la ENERGYFIT KARATE BRAȘOV

source: SUCCESS
ro: SUCCES

source: You have succesfully subscribed to our newsletter
ro: V-ați abonat cu succes la newsletter-ul nostru

source: UNDERCONSTRUCTION
ro: ÎN CONSTRUCȚIE

source: The official webpage of the best FUDOKAN school in Brașov is underconstruction. Stay tunned because we will sound the horn when it is ready
ro: Pagina oficială a celei mai bune școli FUDOKAN din Brașov este în construcție. Rămâneți pe fază pentru că vom suna din goarnă când va fi gata

source: Subscribe our newsletter to stay in touch. Click here
ro: Abonați-vă la newsletter-ul nostru pentru a rămâne în contact. Click aici

source: <span>Unsubscribe</span> <span></span>
ro: <span>Dezabonare</span> <span></span>

source: <h4 class='cta-block__title'>Unsubscribe <span>from Newsletter</span></h4>
ro: <h4 class='cta-block__title'>Dezabonare <span>de la Newsletter</span></h4>

source: <p class='cta-block__text'>Are you sure you wish to cancel your subscription? If yes please type your email address in the box bellow</p>
ro: <p class='cta-block__text'>Sunteți sigur că doriți să vă anulați abonarea? Dacă da, vă rugăm să introduceți adresa dvs. de e-mail în caseta de mai jos</p>.

source: Your email
ro: Emailul dvs

source: Unsubscribe
ro: Dezabonare

source: This email already exists in our database!
ro: Acest e-mail există deja în baza noastră de date!

source: Thank you for subscribing to our newsletter! You can finalize the process by clicking on this <a style='padding:2px 1px;border:2px solid black' href='{}subscription-confirmation/?email={}&conf_num={}'> button</a>.
ro: Vă mulțumim că v-ați abonat la newsletter-ul nostru! Puteți finaliza procesul făcând clic pe acest buton <a style='padding:2px 1px;border:2px solid black' href='{}subscription-confirmation/?email={}&conf_num={}'></a>.

source: A confirmation link was sent to your email inbox. Please check!
ro: Un link de confirmare a fost trimis în căsuța dvs. de e-mail. Vă rugăm să verificați!

source: Error! Your email cannot be registered. Please contact our IT department at +40 758 039 784
ro: Eroare! E-mailul dvs. nu poate fi înregistrat. Vă rugăm să contactați departamentul nostru IT la +40 758 039 784

source: Success! Unsubscribing was finalized. If you change your mind you can subscribe again anytime
ro: Succes! Dezabonarea a fost finalizată. Dacă te răzgândești, te poți abona din nou oricând

source: Error! Unsubscribing failed. This email does not exist in our database
ro: Eroare! Dezabonarea nu a reușit. Acest e-mail nu există în baza noastră de date

source: Error! Unsubscribing failed. Please contact our IT department at +40 758 039 784
ro: Eroare! Dezabonarea nu a reușit. Vă rugăm să contactați departamentul nostru IT la +40 758 039 784

source: Error! Email incorrect.
ro: Eroare! Email incorect.

source: Thank you for writing us {message_author}! We will answer as soon as possible.
ro: Vă mulțumim că ne-ați scris {message_author}! vom raspunde cat de curand posibil.

source: Failed! Please make sure your info is correct!
ro: A eșuat! Vă rugăm să vă asigurați că informațiile dvs. sunt corecte!

source: Failed! Please fill in the captcha field again!
ro: A eșuat! Vă rugăm să completați din nou câmpul captcha!

source: Warning! {e}
ro: Avertizare! {e}

source: See our video
ro: Vezi video

source: Hours Training
ro: Ore de antrenament

source: Competitions
ro: Ore de antrenament

source: Students
ro: Studenți

source: At Energyfit Karate we envision a community where people of all ages, backgrounds, abilities, and genders feel safe, valued, and inspired to work towards building a better self, both physically and mentally
ro: La Energyfit Karate ne imaginăm o comunitate în care oamenii de toate vârstele, mediile, abilitățile și genurile se simt în siguranță, apreciați și inspirați să lucreze pentru a construi un sine mai bun, atât fizic cât și mental

source: OUR <span>EVENTS</span> CALENDAR</h2>
ro: CALENDARUL <span>EVENIMENTELOR</span> NOASTRE</h2>

source: Below you can find the events we are involved in
ro: Mai jos puteți afla informații despre evenimentele la care vom participa

source: <h1 class='title'>EVENTS<span> CALENDAR</span></h1>
ro: <h1 class='title'>CALENDARUL<span> EVENIMENTELOR</span></h1>

source: Events Calendar
ro: Calendarul Evenimentelor

source: <h1 class='title'>TRAINING <span>PROGRAM</span></h1>
ro: <h1 class='title'>PROGRAMUL <span>ANTRENAMENTELOR</span></h1>

source: Training Program
ro: Programul Antrenamentelor

source: OUR <span>TRAINING</span> SCHEDULE</h2>
ro: PROGRAMUL <span>ANTRENAMENTELOR</span> NOASTRE</h2>

source: Below you can the weekly training schedule
ro: Mai jos puteți vedea programul săptămânal de antrenament
